test/testdata/3.0.admin.advertiser-invoice.{number}@get.json

{
    "status": 1,
    "message": {
        "number": 1,
        "supplier_id": "5a37c01cbf0b6b18008b4567",
        "created_at": "2018-01-11",
        "updated_at": "2018-01-11",
        "start_date": "2017-12-05",
        "end_date": "2017-12-07",
        "status": "paid",
        "detail": [
            {
                "offer_id": 1,
                "payout_type": "RPA",
                "actions": 100,
                "amount": 100,
                "comment": null
            }
        ],
        "currency": "USD",
        "comment": null
    }
}
